spec/fixtures/xrechnung.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- generated by https://xrechnungsgenerator.nortal.com/ -->
<ubl:Invoice xmlns:ubl="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2 http://docs.oasis-open.org/ubl/os-UBL-2.1/xsd/maindoc/UBL-Invoice-2.1.xsd">
  <cbc:CustomizationID>urn:cen.eu:en16931:2017#compliant#urn:xeinkauf.de:kosit:xrechnung_3.0</cbc:CustomizationID>
  <cbc:ProfileID>urn:fdc:peppol.eu:2017:poacc:billing:01:1.0</cbc:ProfileID>
  <cbc:ID>0815-99-1-a</cbc:ID>
  <cbc:IssueDate>2020-08-21</cbc:IssueDate>
  <cbc:DueDate>2020-08-31</cbc:DueDate>
  <cbc:InvoiceTypeCode>380</cbc:InvoiceTypeCode>
  <cbc:Note>#AAI#Rechnungsbetreff: Informationen zur Rechnung 1</cbc:Note>
  <cbc:Note>#AAI#Informationen zur Rechnung 2</cbc:Note>
  <cbc:TaxPointDate>2021-04-20</cbc:TaxPointDate>
  <cbc:DocumentCurrencyCode>EUR</cbc:DocumentCurrencyCode>
  <cbc:BuyerReference>9900 0000 - 1234 56 - 23</cbc:BuyerReference>
  <cac:InvoicePeriod>
    <cbc:StartDate>2021-04-01</cbc:StartDate>
    <cbc:EndDate>2021-04-30</cbc:EndDate>
  </cac:InvoicePeriod>
  <cac:OrderReference>
    <cbc:ID>0815-99-1</cbc:ID>
  </cac:OrderReference>
  <cac:BillingReference>
    <cac:InvoiceDocumentReference>
      <cbc:ID>Vorangegangene Rechnung 23423</cbc:ID>
      <cbc:IssueDate>2020-04-23</cbc:IssueDate>
    </cac:InvoiceDocumentReference>
  </cac:BillingReference>
  <cac:ContractDocumentReference>
    <cbc:ID>23871349</cbc:ID>
  </cac:ContractDocumentReference>
  <cac:ProjectReference>
    <cbc:ID>Bauvorhaben Glücksstraße 4</cbc:ID>
  </cac:ProjectReference>
  <cac:AccountingSupplierParty>
    <cac:Party>
      <cbc:EndpointID schemeID="EM">harry.hirsch@hhhtb.de</cbc:EndpointID>
      <cac:PostalAddress>
        <cbc:StreetName>Beispielgasse 17</cbc:StreetName>
        <cbc:AdditionalStreetName>Haus A</cbc:AdditionalStreetName>
        <cbc:CityName>Baustadt</cbc:CityName>
        <cbc:PostalZone>12345</cbc:PostalZone>
        <cbc:CountrySubentity>MusterBL</cbc:CountrySubentity>
        <cac:Country>
          <cbc:IdentificationCode>DE</cbc:IdentificationCode>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyTaxScheme>
        <cbc:CompanyID>DE 214365879</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:ID>VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>Harry Hirsch Holz- und Trockenbau</cbc:RegistrationName>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>Harry Hirsch</cbc:Name>
        <cbc:Telephone>+49 12345 78 657 - 8</cbc:Telephone>
        <cbc:ElectronicMail>harry.hirsch@hhhtb.de</cbc:ElectronicMail>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingSupplierParty>
  <cac:AccountingCustomerParty>
    <cac:Party>
      <cbc:EndpointID schemeID="EM">manfred.mustermann@bauamt.de</cbc:EndpointID>
      <cac:PartyIdentification>
        <cbc:ID>70012</cbc:ID>
      </cac:PartyIdentification>
      <cac:PostalAddress>
        <cbc:StreetName>Malerweg 2</cbc:StreetName>
        <cbc:AdditionalStreetName>Hinterhof A</cbc:AdditionalStreetName>
        <cbc:CityName>Großstadt</cbc:CityName>
        <cbc:PostalZone>01091</cbc:PostalZone>
        <cbc:CountrySubentity>Sachsen</cbc:CountrySubentity>
        <cac:Country>
          <cbc:IdentificationCode>DE</cbc:IdentificationCode>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>Bauamt GmbH &amp; Co KG</cbc:RegistrationName>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>Manfred Mustermann</cbc:Name>
        <cbc:Telephone>+49 12345 98 765 - 44</cbc:Telephone>
        <cbc:ElectronicMail>manfred.mustermann@bauamt.de</cbc:ElectronicMail>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingCustomerParty>
  <cac:TaxRepresentativeParty>
    <cac:PartyName>
      <cbc:Name>Donald Duck</cbc:Name>
    </cac:PartyName>
    <cac:PostalAddress>
      <cbc:StreetName>Malerweg 2</cbc:StreetName>
      <cbc:AdditionalStreetName>Hinterhof A</cbc:AdditionalStreetName>
      <cbc:CityName>Großstadt</cbc:CityName>
      <cbc:PostalZone>01091</cbc:PostalZone>
      <cbc:CountrySubentity>Sachsen</cbc:CountrySubentity>
      <cac:Country>
        <cbc:IdentificationCode>DE</cbc:IdentificationCode>
      </cac:Country>
    </cac:PostalAddress>
    <cac:PartyTaxScheme>
      <cbc:CompanyID>DE214365879</cbc:CompanyID>
      <cac:TaxScheme>
        <cbc:ID>VAT</cbc:ID>
      </cac:TaxScheme>
    </cac:PartyTaxScheme>
  </cac:TaxRepresentativeParty>
  <cac:PaymentMeans>
    <cbc:PaymentMeansCode>30</cbc:PaymentMeansCode>
    <cbc:InstructionNote>Textvermerk der Zahlung</cbc:InstructionNote>
    <cbc:PaymentID>Verwendungszweck</cbc:PaymentID>
    <cac:PayeeFinancialAccount>
      <cbc:ID>DE12500105170648489890</cbc:ID>
      <cbc:Name>Harry Hirsch</cbc:Name>
      <cac:FinancialInstitutionBranch>
        <cbc:ID>XUFUXHB</cbc:ID>
      </cac:FinancialInstitutionBranch>
    </cac:PayeeFinancialAccount>
  </cac:PaymentMeans>
  <cac:PaymentTerms>
    <cbc:Note>Zahlungsziel: 10 Tage nach Zugang der Rechnung</cbc:Note>
  </cac:PaymentTerms>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="EUR">297.09</cbc:TaxAmount>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="EUR">1294.30</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="EUR">207.09</cbc:TaxAmount>
      <cac:TaxCategory>
        <cbc:ID>S</cbc:ID>
        <cbc:Percent>16.00</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="EUR">1285.70</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="EUR">90.00</cbc:TaxAmount>
      <cac:TaxCategory>
        <cbc:ID>S</cbc:ID>
        <cbc:Percent>7.00</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
  </cac:TaxTotal>
  <cac:LegalMonetaryTotal>
    <cbc:LineExtensionAmount currencyID="EUR">2580.00</cbc:LineExtensionAmount>
    <cbc:TaxExclusiveAmount currencyID="EUR">2580.00</cbc:TaxExclusiveAmount>
    <cbc:TaxInclusiveAmount currencyID="EUR">2877.09</cbc:TaxInclusiveAmount>
    <cbc:AllowanceTotalAmount currencyID="EUR">0.00</cbc:AllowanceTotalAmount>
    <cbc:ChargeTotalAmount currencyID="EUR">0.00</cbc:ChargeTotalAmount>
    <cbc:PrepaidAmount currencyID="EUR">0.00</cbc:PrepaidAmount>
    <cbc:PayableRoundingAmount currencyID="EUR">0.00</cbc:PayableRoundingAmount>
    <cbc:PayableAmount currencyID="EUR">2877.09</cbc:PayableAmount>
  </cac:LegalMonetaryTotal>
  <cac:InvoiceLine>
    <cbc:ID>0</cbc:ID>
    <cbc:InvoicedQuantity unitCode="XPP">1.00</cbc:InvoicedQuantity>
    <cbc:LineExtensionAmount currencyID="EUR">1294.30</cbc:LineExtensionAmount>
    <cac:AllowanceCharge>
      <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
      <cbc:AllowanceChargeReasonCode>95</cbc:AllowanceChargeReasonCode>
      <cbc:AllowanceChargeReason>Rabatt</cbc:AllowanceChargeReason>
      <cbc:Amount currencyID="EUR">1.00</cbc:Amount>
    </cac:AllowanceCharge>
    <cac:Item>
      <cbc:Description>Leimbinder 2x18m; Birke</cbc:Description>
      <cbc:Name>Leimbinder</cbc:Name>
      <cac:StandardItemIdentification>
        <cbc:ID schemeID="0160">L218</cbc:ID>
      </cac:StandardItemIdentification>
      <cac:ClassifiedTaxCategory>
        <cbc:ID>S</cbc:ID>
        <cbc:Percent>16.00</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:ClassifiedTaxCategory>
    </cac:Item>
    <cac:Price>
      <cbc:PriceAmount currencyID="EUR">1295.30</cbc:PriceAmount>
      <cbc:BaseQuantity unitCode="XPP">1.00</cbc:BaseQuantity>
      <cac:AllowanceCharge>
        <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
        <cbc:Amount currencyID="EUR">1.00</cbc:Amount>
        <cbc:BaseAmount currencyID="EUR">1296.30</cbc:BaseAmount>
      </cac:AllowanceCharge>
    </cac:Price>
  </cac:InvoiceLine>
  <cac:InvoiceLine>
    <cbc:ID>1</cbc:ID>
    <cbc:InvoicedQuantity unitCode="XPP">5.00</cbc:InvoicedQuantity>
    <cbc:LineExtensionAmount currencyID="EUR">1285.70</cbc:LineExtensionAmount>
    <cac:InvoicePeriod>
      <cbc:StartDate>2021-04-07</cbc:StartDate>
      <cbc:EndDate>2021-04-13</cbc:EndDate>
    </cac:InvoicePeriod>
    <cac:Item>
      <cbc:Description>Dichtungsfolie 2.5 mm stark, 1.5 m breit</cbc:Description>
      <cbc:Name>Dichtungsfolie</cbc:Name>
      <cac:StandardItemIdentification>
        <cbc:ID schemeID="0160">D4567890</cbc:ID>
      </cac:StandardItemIdentification>
      <cac:ClassifiedTaxCategory>
        <cbc:ID>S</cbc:ID>
        <cbc:Percent>7.00</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:ClassifiedTaxCategory>
    </cac:Item>
    <cac:Price>
      <cbc:PriceAmount currencyID="EUR">257.14</cbc:PriceAmount>
      <cbc:BaseQuantity unitCode="XPP">1.00</cbc:BaseQuantity>
      <cac:AllowanceCharge>
        <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
        <cbc:Amount currencyID="EUR">0.00</cbc:Amount>
        <cbc:BaseAmount currencyID="EUR">257.14</cbc:BaseAmount>
      </cac:AllowanceCharge>
    </cac:Price>
  </cac:InvoiceLine>
</ubl:Invoice>
